; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v9)
             (pred_2 ?v3 ?v4)
             (pred_11 ?v11 ?v4)
             (pred_9 ?v1 ?v11 )
	     (pred_4 ?v11)
             (pred_12 ?v6)
             (pred_6 ?v3)
             (pred_7 ?v4)
             (pred_3 ?v11)
             (pred_1 ?v3)
             (pred_8 ?v11)
             (pred_5 ))



(:action op_5
:parameters (?v8 ?v5 ?v10 ?v12)
:precondition (and (pred_12 ?v8) (pred_12 ?v5) (pred_6 ?v10) (pred_7 ?v12)
          (pred_10 ?v8 ?v5) (pred_2 ?v10 ?v12)
                   (pred_11 ?v5 ?v12) (pred_4 ?v8) 
                   (pred_3 ?v5) (pred_1 ?v10))
:effect (and  (pred_8 ?v5) (not (pred_3 ?v5))))


(:action op_4
:parameters (?v8 ?v7)
:precondition (and (pred_12 ?v8) (pred_12 ?v7)
               (pred_4 ?v8) (pred_10 ?v8 ?v7) (pred_8 ?v7))
:effect (and (pred_4 ?v7) (not (pred_4 ?v8))))

(:action op_2
:parameters (?v8 ?v10)
:precondition (and (pred_12 ?v8) (pred_6 ?v10) 
                  (pred_4 ?v8) (pred_9 ?v10 ?v8) (pred_5 ))
:effect (and (pred_1 ?v10)
   (not (pred_9 ?v10 ?v8)) (not (pred_5 ))))


(:action op_1
:parameters (?v8 ?v2 ?v13)
:precondition (and (pred_12 ?v8) (pred_6 ?v2) (pred_6 ?v13)
                  (pred_4 ?v8) (pred_1 ?v13) (pred_9 ?v2 ?v8))
:effect (and (pred_1 ?v2) (pred_9 ?v13 ?v8)
        (not (pred_1 ?v13)) (not (pred_9 ?v2 ?v8))))

(:action op_3
:parameters (?v8 ?v10)
:precondition (and (pred_12 ?v8) (pred_6 ?v10) 
                  (pred_4 ?v8) (pred_1 ?v10))
:effect (and (pred_5 ) (pred_9 ?v10 ?v8) (not (pred_1 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_27 obj_03 obj_19 obj_08 obj_13 obj_04 obj_22 obj_31 obj_11 obj_26 obj_12 obj_15 obj_09 obj_20 obj_07 obj_30 obj_16 obj_10 obj_01 obj_23 obj_05 obj_28 obj_25 obj_14 obj_17
    obj_21 obj_24 obj_29
    obj_02 obj_06 obj_18
    )

    (:init
       (pred_5)

       (pred_12 obj_27)
       (pred_12 obj_03)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_22)
       (pred_12 obj_31)
       (pred_12 obj_11)
       (pred_12 obj_26)
       (pred_12 obj_12)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_30)
       (pred_12 obj_16)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_23)
       (pred_12 obj_05)
       (pred_12 obj_28)
       (pred_12 obj_25)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_7 obj_21)
       (pred_7 obj_24)
       (pred_7 obj_29)
       (pred_6 obj_02)
       (pred_6 obj_06)
       (pred_6 obj_18)

       (pred_10 obj_27 obj_04)
       (pred_10 obj_27 obj_03)
       (pred_10 obj_03 obj_22)
       (pred_10 obj_03 obj_19)
       (pred_10 obj_03 obj_27)
       (pred_10 obj_19 obj_31)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_03)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_13 obj_26)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_04 obj_22)
       (pred_10 obj_04 obj_27)
       (pred_10 obj_22 obj_15)
       (pred_10 obj_22 obj_31)
       (pred_10 obj_22 obj_03)
       (pred_10 obj_22 obj_04)
       (pred_10 obj_31 obj_09)
       (pred_10 obj_31 obj_11)
       (pred_10 obj_31 obj_19)
       (pred_10 obj_31 obj_22)
       (pred_10 obj_11 obj_20)
       (pred_10 obj_11 obj_26)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_11 obj_31)
       (pred_10 obj_26 obj_07)
       (pred_10 obj_26 obj_13)
       (pred_10 obj_26 obj_11)
       (pred_10 obj_12 obj_30)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_15 obj_16)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_15 obj_22)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_09 obj_31)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_20 obj_11)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_07 obj_23)
       (pred_10 obj_07 obj_26)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_30 obj_05)
       (pred_10 obj_30 obj_16)
       (pred_10 obj_30 obj_12)
       (pred_10 obj_16 obj_28)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_16 obj_15)
       (pred_10 obj_16 obj_30)
       (pred_10 obj_10 obj_25)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_23)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_23 obj_17)
       (pred_10 obj_23 obj_07)
       (pred_10 obj_23 obj_01)
       (pred_10 obj_05 obj_28)
       (pred_10 obj_05 obj_30)
       (pred_10 obj_28 obj_25)
       (pred_10 obj_28 obj_16)
       (pred_10 obj_28 obj_05)
       (pred_10 obj_25 obj_14)
       (pred_10 obj_25 obj_10)
       (pred_10 obj_25 obj_28)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_14 obj_25)
       (pred_10 obj_17 obj_23)
       (pred_10 obj_17 obj_14)
       (pred_3 obj_13)
       (pred_3 obj_19)
       (pred_3 obj_20)
       (pred_11  obj_13 obj_21)
       (pred_11  obj_19 obj_24)
       (pred_11  obj_20 obj_29)
       (pred_8 obj_27)
       (pred_8 obj_03)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_22)
       (pred_8 obj_31)
       (pred_8 obj_11)
       (pred_8 obj_26)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_09)
       (pred_8 obj_07)
       (pred_8 obj_30)
       (pred_8 obj_16)
       (pred_8 obj_10)
       (pred_8 obj_01)
       (pred_8 obj_23)
       (pred_8 obj_05)
       (pred_8 obj_28)
       (pred_8 obj_25)
       (pred_8 obj_14)
       (pred_8 obj_17)

       (pred_2  obj_02 obj_21)
       (pred_2  obj_06 obj_24)
       (pred_2  obj_18 obj_29)
       (pred_9 obj_02 obj_08)
       (pred_9 obj_06 obj_27)
       (pred_9 obj_18 obj_05)
       (pred_4 obj_15)
    )

    (:goal (and
       (pred_9 obj_06 obj_25)
    ))
(:constraints
  (always (not (pred_4 obj_22)))
)
)

; plan
1. (op_4 obj_15 obj_12)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_12)
   goals met: 0 of 1
2. (op_4 obj_12 obj_04)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_04)
   goals met: 0 of 1
3. (op_4 obj_04 obj_27)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_27)
   goals met: 0 of 1
4. (op_2 obj_27 obj_06)
   deleted: (pred_9 obj_06 obj_27) (pred_5)
   added: (pred_1 obj_06)
   goals met: 0 of 1
5. (op_4 obj_27 obj_04)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_04)
   goals met: 0 of 1
6. (op_4 obj_04 obj_12)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_12)
   goals met: 0 of 1
7. (op_4 obj_12 obj_15)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_15)
   goals met: 0 of 1
8. (op_4 obj_15 obj_09)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_09)
   goals met: 0 of 1
9. (op_4 obj_09 obj_10)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_10)
   goals met: 0 of 1
10. (op_4 obj_10 obj_25)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_25)
   goals met: 0 of 1
11. (op_3 obj_25 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_5) (pred_9 obj_06 obj_25)
   goals met: 1 of 1
